# FilteredWorksetIdIterator Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
FilteredWorksetIdIterator Properties
FilteredWorksetIdIterator Class See Also
---
The FilteredWorksetIdIterator type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Current | Gets the item at the current position of the iterator. |
| CurrentObject |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also
FilteredWorksetIdIterator Class
Autodesk.Revit.DB Namespace